{
    "drugs":[
        
        {
            "Name": "ACETAMINOPHEN (Tylenol, Ofrimev)",
            "Class": "An analgesic and anti-pyretic",
            "Mechanism Of Action": "Acetaminophen is an analgesics and antipyretics. The exact mechanism of action of acetaminophen is not known. It may reduce the production of prostaglandins in the brain. Prostaglandins are chemicals that cause inflammation and swelling. Acetaminophen relieves pain by elevating the pain threshold, that is, by requiring a greater amount of pain to develop before a person feels it. It reduces fever through its action on the heat-regulating center of the brain. Specifically, it tells the center to lower the body's temperature when the temperature is elevated.",
            "Indications": "An effective analgesic and anti-pyretic for the treatment of fever and pain.",
            "Contraindications": "Allergy to medication. Severe liver disease.",
            "Adverse Reactions": "",
            "Drug Interactions": "",
            "Adult Dosage": "650 - 1000 mg, PO q 4 hrs to a daily maximum of 3000 mg",
            "Pediatric Dosage": "15 mg/kg PO or PR q 4 hrs",  
            "Duration Of Action": "Onset: 30 - 45 minutes. Peak Effect: 30-60 minutes. Duration: 4-6 hrs",
            "Special Considerations": "Avoid in patients with severe liver disease"
        },

        {
            "Name": "ACTIVATED CHARCOAL",
            "Class": "Adsorbent",
            "Mechanism Of Action": "Adsorbs toxic substances from the GI Tract; Onset of action is immediate.",
            "Indications": "Most oral poisonings and medication overdoses; can be used after evacuation of poisons.",
            "Contraindications": "Oral administration to comatose patient; after ingestion of corrosives, caustics or petroleum distillates (ineffective and may induce vomiting); simultaneous administration with other oral drugs.",
            "Adverse Reactions": "May induce nausea and vomiting; may cause constipation; may cause black stools.",
            "Drug Interactions": "Bonds with and generally inactivates whatever it is mixed with, e.g., syrup of ipecac.",
            "Adult Dosage": "1-2 gm/kg PO or via NGT",
            "Pediatric Dosage": "1-2 gm/kg PO or via NGT",  
            "Duration Of Action": "Depends upon GI function; will act until excreted.",
            "Special Considerations": "Often used in conjunction with magnesium citrate, Must be stored in a closed container, Does not adsorb cyanide, lithium, iron, lead and arsenic."
        },

        {
            "Name": "ADENOSINE (Adenocard)",
            "Class": "Endogenous Nucleotide",
            "Mechanism Of Action": "Slows conduction time through the AV Node; can interrupt re-entrant pathways; slows heart rate; acts directly on sinus pacemaker cells. Is drug of choice for PSVT.",
            "Indications": "Conversion of PSVT to sinus rhythm. May convert PSVT due to Wolff-Parkinson- White syndrome. Not effective converting atrial fibrillation / flutter.",
            "Contraindications": "Second or third-degree block or Sick Sinus Syndrome Atrial flutter / atrial fibrillation, Ventricular Tachycardia, Hypersensitivity to adenosine",
            "Adverse Reactions": "Facial flushing, shortness of breath, chest pain, headache, paresthesia, diaphoresis, palpitations, hypotension, nausea, metallic taste.",
            "Drug Interactions": "Methylxanthines (theophylline-like drugs) antagonize the effects of adenosine. Dipyridamole (Persantine) potentiates the effects of adenosine, Carbamazepine (Tegretol) may potentate the AV Node blocking effects of adenosine.",
            "Adult Dosage": " 6 mg over 1-3 seconds; If no response after 1-2 minutes, administer 12 mg over 1-3 seconds, Maximum total dose = 18 mgs.",
            "Pediatric Dosage": "0.1 mg/kg rapid IV; If no response after 1-2 minutes, administer 0.2mg/kg over 1-3 seconds, Maximum total dose = 18 mgs. Maximum single dose = 12 mgs.",  
            "Duration Of Action": "Onset and peak effects in seconds; duration 12 seconds.",
            "Special Considerations": "Short half-life limits side effects in most patients. Pregnancy safety: Category C."
        },

        {
            "Name": "ALBUTEROL (Proventil, Ventolin)",
            "Class": "Sympathomimetic, bronchodilator.",
            "Mechanism Of Action": "Selective b-2 agonist which stimulates adrenergic receptors of the sympathomimetic nervous system resulting in smooth muscle relaxation in the bronchial tree and peripheral vasculature.",
            "Indications": "Treatment of bronchospasm in patients with reversible obstructive airway disease (COPD/asthma).",
            "Contraindications": "Known prior hypersensitivity reactions to Albuterol. Tachycardia, dysrhythmias, especially those caused by digitalis. Synergistic with other sympathomimetics",
            "Adverse Reactions": "Often dose-related and include restlessness, tremors, dizziness, palpitations, tachycardia, nervousness, peripheral vasodilatation, nausea, vomiting, hyperglycemia, increased blood pressure and paradoxical bronchospasm",
            "Drug Interactions": "Tricyclic antidepressants may potentate vasculature effects. Beta-blockers are antagonistic. May potentate hypokalemia caused by diuretics.",
            "Adult Dosage": ": Administer 2.5 mg. Dilute 0.5 ml of 0.5% solution for inhalation with 2.5 ml normal saline in nebulizer and administer over 10-15 minutes.",
            "Pediatric Dosage": "2.5mg in 6mL NS",  
            "Duration Of Action": "5-15 minutes with peak effect in 30-minutes - two hours and duration of 3-4 hours.",
            "Special Considerations": "Pregnancy Safety: Category C. Antagonized by beta-blockers (e.g., Inderal, Metoprolol). May precipitate angina pectoris and dysrhythmias. Should only be administered by inhalation methodology in pre-hospital management."
        },

        {
            "Name": "AMIODARONE (Cordarone)",
            "Class": "Antidysrhythmic.",
            "Mechanism Of Action": "Prolongation of Action Potential; non-competitive alpha and beta sympathetic blocking effects; Calcium channel blocking effects.",
            "Indications": "Suppression of Ventricular Fibrillation/ Pulseless Ventricular Tachycardia refractory to defibrillation, Suppression of Ventricular Tachycardia with a pulse",
            "Contraindications": "Allergy to Iodine, Medication-induced Ventricular dysrhythmias, Torsades de Pointes.",
            "Adverse Reactions": "Hypotension, Bradycardia, Pulseless Electrical Activity, Congestive Heart Failure. Nausea, fever",
            "Drug Interactions": "Will precipitate with Sodium Bicarbonate: incompatible.",
            "Adult Dosage": "VF/ Pulseless VT: 300 mg IV Push in 14 ml Normal Saline, Repeat Dose: 150mg in 7ml Normal saline, V TAC with a Pulse: 150mg in 100mL NS infused over 10 minutes",
            "Pediatric Dosage": " 5mg/kg slow IV Push over 1-2 minutes in 10 ml Normal Saline,",  
            "Duration Of Action": "Onset: Within 5-15 minutes. Peak Effect: Variable. Duration: Variable",
            "Special Considerations": "Pregnancy safety: Category C, Administer cautiously in patients with Heart Failure or poor systolic function."
        },

        {
            "Name": "AMYL NITRITE, SODIUM NITRITE, SODIUM THIOSULFATE (Cyanide Antidote Kit)",
            "Class": "Antidote.",
            "Mechanism Of Action": "Amyl Nitrite: affinity for cyanide ions; reacts with hemoglobin to form methemoglobin (low toxicity). Sodium Nitrite: same as amyl nitrite. Sodium Thiosulfate: produces thiocyanate, which is then excreted.",
            "Indications": "Cyanide or hydrocyanic acid poisoning.",
            "Contraindications": "Not applicable.",
            "Adverse Reactions": "Excessive doses of amyl nitrite and sodium nitrite can produce severe, life-threatening methemoglobinemia. Use only recommended doses.",
            "Drug Interactions": "None.",
            "Adult Dosage": "Amyl nitrite: breathe 30 seconds out of every minute. Sodium Thiosulfate and sodium nitrite: IV per antidote kit directions.",
            "Pediatric Dosage": "Amyl nitrite: breathe 30 seconds out of every minute. Sodium Thiosulfate and sodium nitrite: IV per antidote kit directions.",  
            "Duration Of Action": "Variable.",
            "Special Considerations": "Cyanide poisoning must be recognized quickly and treated quickly; if pulse persists, even in presence of apnea, prognosis is good with treatment. The antidote kit must be used in conjunction with administration of oxygen."
        },

        {
            "Name": "ASPIRIN",
            "Class": "Platelet inhibitor, anti-inflammatory agent.",
            "Mechanism Of Action": "Prostaglandin inhibition (makes the platelets less sticky)",
            "Indications": "Chest pain suggestive of Acute Myocardial Infarction.",
            "Contraindications": "Hypersensitivity. Gastrointestinal bleeding. Signs and symptoms suggestive of recent cerebrovascular accident.",
            "Adverse Reactions": "Heartburn. GI bleeding. Nausea, vomiting. Wheezing in allergic patients. Prolonged bleeding.",
            "Drug Interactions": "Use with caution in patients allergic to NSAIDS.",
            "Adult Dosage": "162 mg to 324 mg PO.",
            "Pediatric Dosage": "Not recommended in pediatric population.",
            "Duration Of Action": "Onset: 30-45 minutes. Peak effect: variable. Duration: Variable.",
            "Special Considerations": "Pregnancy Safety: Category D. Not recommended in pediatric population."
        },

        {
            "Name": "ATROPINE SULFATE",
            "Class": "Anticholinergic agent.",
            "Mechanism Of Action": "Increases conduction through the AV Node. Increases heart rate in life-threatening bradydysrhythmias. Parasympatholytic: inhibits action of acetylcholine at postganglionic parasympathetic neuroeffector sites.",
            "Indications": "Hemodynamically significant bradycardia. Drug of choice for organophosphate poisoning.",
            "Contraindications": "Tachycardia. Hypersensitivity. Unstable cardiovascular status in acute hemorrhage and myocardial ischemia.",
            "Adverse Reactions": "Headache, dizziness, palpitations, nausea and vomiting. Tachycardia, dysrhythmias, anticholinergic effects (blurred vision, dry mouth, urinary retention). Paradoxical bradycardia when pushed slowly or at low doses. Flushed, hot dry skin. ",
            "Drug Interactions": "Effects enhanced by antihistamines, antipsychotics, benzodiazepines and antidepressants.",
            "Adult Dosage": "Bradydysrhythmias: 1mg IV every 3-5 minutes as needed to a maximum total dose of 3mg",
            "Pediatric Dosage": " Bradydysrhythmias: 0.02 mg/kg IV / ET / IO (minimum single dose 0.1 mg, maximum single dose 1.0 mg).",  
            "Duration Of Action": "Onset: Immediate. Peak Effect: Rapid to 1-2 minutes. Duration: 2-6 hours.",
            "Special Considerations": "Pregnancy Safety: Category C. Moderate doses dilate pupils."
        },

        {
            "Name": "CALCIUM CHLORIDE / CALCIUM GLUCONATE",
            "Class": "Electrolyte.",
            "Mechanism Of Action": "Increases cardiac contractile state (positive inotropic effect). May enhance ventricular automaticity. Helps stabilize the cell membrane",
            "Indications": "Hyperkalemia, Magnesium sulfate overdose Calcium channel blocker toxicity Crush syndrome.",
            "Contraindications": "Hypercalcemia, VF during cardiac resuscitation; digitalis toxicity.",
            "Adverse Reactions": "Bradycardia, asystole, hypotension, peripheral vasodilatation, metallic taste, local necrosis, coronary and cerebral artery spasm, nausea, vomiting.",
            "Drug Interactions": "Do not mix with Sodium Bicarbonate in running IV, flush prior to administration in same IV line. May worsen dysrhythmias secondary to digitalis. May antagonize effects of Verapamil.",
            "Adult Dosage": " 500-1000 mg of 10% solution slowly IV over 5 minutes; may repeat in 10 minutes. (maximum: 1 gm dose)",
            "Pediatric Dosage": "20 mg/kg/dose of 10% solution slow IV/ IO (maximum: 1 gm dose); (may repeat in 10 minutes.)",  
            "Duration Of Action": "Onset: 5-15 minutes. Peak effects: 3-5 minutes. Duration: 15-30 minutes but may persist for 4 hours (dose dependent).",
            "Special Considerations": "Pregnancy safety: Category C. For pediatrics: if calcium gluconate is unavailable, 1-2 ml of 10% calcium chloride solution, diluted with IV fluid, may be substituted."
        },

        {
            "Name": "DEXAMETHASONE (Decadron)",
            "Class": "Corticosteroid.",
            "Mechanism Of Action": "Suppresses acute and chronic inflammation, immunosuppressive effects.",
            "Indications": "Anaphylaxis, asthma, spinal cord injury, croup, elevated intracranial pressure (prevention and treatment), as an adjunct to treatment of shock.",
            "Contraindications": "Hypersensitivity to product.",
            "Adverse Reactions": "Hypertension, sodium and water retention, GI bleeding. None from single dose.",
            "Drug Interactions": "Calcium, Metaraminol.",
            "Adult Dosage": "10-100 mg IV (1 mg/kg slow IV bolus). (considerable variance through Medical Control).",
            "Pediatric Dosage": "0.25-1.0 mg/kg/dose IV, IO, IM.",  
            "Duration Of Action": "Onset: Hours. Peak effects: 8-12 hours. Duration: 24-72 hours.",
            "Special Considerations": " Pregnancy safety: unknown. Protect medication form heat. Toxicity and side effects with long-term use."
        },

        {
            "Name": "DEXTROSE",
            "Class": "Carbohydrate, hypertonic solution.",
            "Mechanism Of Action": "Rapidly increases serum glucose levels.",
            "Indications": "Altered level of consciousness secondary to hypoglycemia",
            "Contraindications": "Intracranial hemorrhage Delirium tremens",
            "Adverse Reactions": "Extravagation leads to tissue necrosis. Warmth, pain, burning, thrombophlebitis, rhabdomyositis.",
            "Drug Interactions": "Sodium bicarbonate, coumadin.",
            "Adult Dosage": "12.5-25 gram slow IV; may be repeated as necessary.",
            "Pediatric Dosage": "0.5-1 gram/kg/dose slow IV; may be repeated as necessary.",  
            "Duration Of Action": "Onset: less than 1 minute. Peak effects: variable. Duration: Variable. ",
            "Special Considerations": "Draw blood sugar before administering. Do not administer to patients with known CVA unless hypoglycemia documented."
        },

        {
            "Name": "DIAZEPAM (Valium)",
            "Class": "Benzodiazepine, anticonvulsant, sedative-hypnotic",
            "Mechanism Of Action": "Potentates effects of inhibitory neurotransmitters. Raises seizure threshold. Induces amnesia and sedation.",
            "Indications": "Status Seizure, Acute anxiety states, Analgesia for medical procedures (fracture reduction, cardioversion), Delirium tremens.",
            "Contraindications": "Hypersensitivity, glaucoma. coma, shock, substance abuse, head injury.",
            "Adverse Reactions": "Respiratory depression, hypotension, drowsiness, ataxia, reflex tachycardia, nausea, confusion.",
            "Drug Interactions": "",
            "Adult Dosage": "Seizure activity: 5-10 mg IV q 10-15 minutes prn (5 mg over 5 min.) (maximum dose = 30 mgs). Rectal diazepam: 0.5 mg/kg via 2” rectal catheter and flush with 2-3 ml air after administration. Sedation for cardioversion: 5- 15 mg IV over 5-10 minutes prior to cardioversion.",
            "Pediatric Dosage": "Seizure activity: 0.2 mg/kg/dose IV every 15-30 minutes (no faster than 3 mg over 5 minutes) (max. = 10 mg). Rectal diazepam: 0.5 mg/kg via 2” rectal catheter and flush with 2-3 ml air after administration. Sedation for cardioversion: 5- 15 mg IV over 5-10 minutes prior to cardioversion.",  
            "Duration Of Action": "Onset: 1-5 minutes. Peak effect: minutes. Duration: 20-50 minutes.",
            "Special Considerations": "Pregnancy safety: Category D. Short duration of anticonvulsant effect. Reduce dose 50% in elderly patient."
        },

        {
            "Name": "DILTIAZEM HCL (Cardizem)",
            "Class": "Calcium channel blocker",
            "Mechanism Of Action": "Block influx of calcium ions into cardiac muscle Arterial and venous vasodilator. Reduces preload and afterload. Reduces myocardial oxygen demand.",
            "Indications": "Atrial flutter,/Atrial fibrillation with rapid ventricular rates.vv",
            "Contraindications": "Wide-complex tachycardia Sick sinus syndrome Cardiogenic shock.",
            "Adverse Reactions": "Bradycardia, second or third-degree AV blocks, chest pain, CHF, syncope. V-Fib, V-tach, nausea, vomiting, dizziness, dry mouth, dyspnea, headache.",
            "Drug Interactions": "Caution in patients using medications that affect cardiac contractility. In general, should not be used in patients on Beta-blockers.",
            "Adult Dosage": "Initial bolus: 0.25 mg/ kg (average dose 20 mg) IV over two (2) minutes. If inadequate response may re-bolus in 15 minutes: 0.35 mg/kg IV over two (2) minutes.",
            "Pediatric Dosage": "Not recommended.",  
            "Duration Of Action": "Onset: 2-5 minutes. Peak effect: Variable. Duration: 1-3 hours.",
            "Special Considerations": "Pregnancy safety: category C. Use in caution in patients with renal or hepatic dysfunction."
        },

        {
            "Name": "DIPHENHYDRAMINE (Benadryl)",
            "Class": "Antihistamine",
            "Mechanism Of Action": "Blocks cellular histamine receptors; decreases vasodilatation Reverses extrapyramidal reactions.",
            "Indications": "Asthma, glaucoma, pregnancy, hypertension, infants, MAOI'S.",
            "Contraindications": "Sedation, hypotension, seizures, visual disturbances, vomiting, palpitations, dysrhythmias, dry mouth and throat, paradoxical CNS excitation in children.",
            "Adverse Reactions": "Potentates effects of alcohol and other anticholinergics, may inhibit corticosteroid activity.",
            "Drug Interactions": "Potentates effects of alcohol and other anticholinergics, may inhibit corticosteroid activity.",
            "Adult Dosage": "25 - 50 mg IM or IV or P.O.",
            "Pediatric Dosage": "1-2 mg/kg IV, IO slowly or IM. If given PO: 5 mg./ kg. / 24 hours.",  
            "Duration Of Action": "Onset: 15-30 minutes. Peak effect: 1 hour. Duration: 3-12 hours.",
            "Special Considerations": "Not used in infants or in pregnancy: Category B. If used in anaphylaxis, will be in conjunction with epinephrine, steroids"
        },

        {
            "Name": "DOPAMINE (Inotropin)",
            "Class": "Sympathomimetic, inotropic agent.",
            "Mechanism Of Action": "Immediate metabolic precursor to Norepinephrine. Increases systemic vascular resistance, dilate renal and splanchnic vasculature. Increases myocardial contractility and stroke volume.",
            "Indications": "Cardiogenic, septic or spinal shock, hypotension with low cardiac output states. Distributive shock.",
            "Contraindications": "Hypovolemic shock, pheochromocytoma, tachydysrhythmias, VF.",
            "Adverse Reactions": "Cardiac dysrhythmias, hypertension, increased myocardial oxygen demand, extravagation may cause tissue necrosis.",
            "Drug Interactions": "Incompatible in alkaline solutions. Beta blockers may antagonize effects of dopamine.",
            "Adult Dosage": "2- 20 mcg / kg / min. (Rate determined by physician).",
            "Pediatric Dosage": "2 - 20 mcg / kg / min. (Rate determined by physician).",  
            "Duration Of Action": "Onset: 1-4 minutes. Peak Effect: 5-10 minutes. Duration: Effects cease almost immediately after infusion shut off.",
            "Special Considerations": "Pregnancy safety not established. Effects are dose-dependent Dopaminergic response: 2-4 mcg / kg / min.: dilates vessels in kidneys; inc. urine output. Beta-adrenergic response: 4-10 mcg / kg / min.: Increased chronotropy and inotropy Adrenergic response: 10-20 mcg / kg / min.: Primarily alpha stimulant / vasoconstriction. Greater than 20 mcg / kg / min.: reversal of renal effects / override alpha effects. Always monitor drip rate. Avoid extravagation injury."
        },

        {
            "Name": "EPINEPHRINE",
            "Class": "Sympathomimetic.",
            "Mechanism Of Action": "Direct acting alpha and beta agonist. Alpha: bronchial, cutaneous, renal and visceral arteriolar vasoconstriction. Beta 1: positive inotropic and chronotropic actions, increases automaticity. Beta 2: bronchial smooth muscle relaxation and dilation of skeletal vasculature Blocks histamine release.",
            "Indications": "Cardiac arrest, asystole, PEA, VF unresponsive to initial defib. Severe bronchospasm, asthma, bronchiolitis. Anaphylaxis, acute allergic reactions.",
            "Contraindications": "Hypertension, hypothermia, pulmonary edema, coronary insufficiency, hypovolemic shock.",
            "Adverse Reactions": "Hypertension, dysrhythmias, pulmonary edema, anxiety, psychomotor agitation, nausea, angina, headache, restlessness.",
            "Drug Interactions": "Potentates other sympathomimetics. Deactivated by alkaline solutions. MAOIs may potentate effects of epinephrine.",
            "Adult Dosage": "Allergic reactions and asthma: 0.3 - 0.5 mg (0.3 - 0.5 ml 1:1000) IM Anaphylaxis: 0.3 - 0.5 mg (3- 5 ml 1:10,000) IV Cardiac: (asystole, PEA, VF) 1 mg IV push (1:10,000) every 3- 5 minutes",
            "Pediatric Dosage": "Allergic reactions and asthma: 0.01 mg/kg (0.01 mL/kg 1:1000) IM to maximum of 0.5 mg. Cardiac: (asystole, PEA, VF) IV, IO: Standard initial dose: 0.01 mg/kg (1:10,000, 0.1mL/kg)",  
            "Duration Of Action": "Onset: Immediate. Peak Effects: Minutes. Duration: Several minutes.",
            "Special Considerations": "Pregnancy Safety: Category C."
        },

        {
            "Name": "ETOMIDATE (Amidate)",
            "Class": "Nonbarbiturate hypnotic, anesthesia induction agent",
            "Mechanism Of Action": "Short acting hypnotic that acts at the level of the reticular activating system.",
            "Indications": "Premedication for RSI",
            "Contraindications": "Hypersensitivity, labor/delivery, or septic shock.",
            "Adverse Reactions": "Apnea of short duration, respiratory depression, hypoventilation, hypotension, dysrhythmias, nausea, vomiting, involuntary muscle movement.",
            "Drug Interactions": "Effects may be enhanced when given with other CNS depressants.",
            "Adult Dosage": "0.2 - 0.6 mg/kg IV (typical adult dose is 20mg)",
            "Pediatric Dosage": "0.2 - 0.4mg/kg IV/IO to assist with RSI (over 10 years old), one time only, max 20mg.",  
            "Duration Of Action": "Onset: less than 1 minute. Peak Effect: 1 minute Duration: 5-10 minutes",
            "Special Considerations": "Pregnancy Safety: Category C. Use caution weighing fetal risk and maternal benefit in pregnant and breastfeeding women."
        },

        {
            "Name": "FENTANYL CITRATE (Sublimaze)",
            "Class": "Narcotic Analgesic",
            "Mechanism Of Action": "Fentanyl citrate is a narcotic analgesic. A dose of 100 mcg (0.1 mg) (2 mL) is approximately equivalent in analgesic activity to 10 mg of morphine",
            "Indications": "Analgesic action of short duration during the anesthetic periods RSI premedication, induction and maintenance Narcotic analgesic supplement in general or regional anesthesia.",
            "Contraindications": "Fentanyl Citrate Injection is contraindicated in patients with known intolerance to the drug",
            "Adverse Reactions": "As with other narcotic analgesics, the most common serious adverse reactions reported to occur with fentanyl are respiratory depression, apnea, rigidity and bradycardia; if these remain untreated, respiratory arrest, circulatory depression or cardiac arrest could occur. Other adverse reactions that have been reported are hypertension, hypotension, dizziness, blurred vision, nausea, emesis, laryngospasm and diaphoresis. It has been reported that secondary rebound respiratory depression may occasionally occur. Patients should be monitored for this possibility and appropriate countermeasures taken as necessary.",
            "Drug Interactions": "",
            "Adult Dosage": "1 mcg/kg. to max. 150 mcg. slow IV push. (Nasal administration may be permitted by the State Treatment Protocols in certain cases.)",
            "Pediatric Dosage": " The safety and efficacy of fentanyl citrate in pediatric patients under two years of age has not been established.",  
            "Duration Of Action": "Onset: The onset of action of fentanyl is almost immediate when the drug is given intravenously; however, the maximal analgesic and respiratory depressant effect may not be noted for several minutes. Peak effect: The peak respiratory depressant effect of a single intravenous dose of fentanyl citrate is noted as 5 to 15 minutes following injection Duration: The usual duration of action of the analgesic effect is 30 to 60 minutes after a single intravenous dose of up to 100 mcg.",
            "Special Considerations": "Pregnancy safety: Category C"
        },

        {
            "Name": "FLUMAZENIL (Romazicon)",
            "Class": "Benzodiazepine receptor antagonist, antidote",
            "Mechanism Of Action": "Reversal of respiratory depression and sedation from pure benzodiazepine overdose",
            "Indications": "Reversal of respiratory depression and sedation from pure benzodiazepine overdose",
            "Contraindications": "Hypersensitivity to flumazenil or to benzodiazepines, Tricyclic antidepressant overdose, Chronic benzodiazepine users or alcoholics, Cocaine or other stimulant intoxication. Known seizure disorder (relative)",
            "Adverse Reactions": "Nausea and vomiting Dizziness, Headache, Agitation, Injection site pain, Cutaneous vasodilation Abnormal vision, Seizures",
            "Drug Interactions": "Toxic effects of mixed drug overdose (especially tricyclic antidepressants) may emerge with the reversal of the benzodiazepine effects.",
            "Adult Dosage": "First dose: 0.2 mg IV over 15 sec. Second dose: 0.3 mg IV over 30 sec. Third dose: 0.5 mg over 30 sec at 1-min intervals until adequate response or max dose of 3 mg",
            "Pediatric Dosage": "Not recommended",  
            "Duration Of Action": "Onset: 1-2 min. Duration: Related to plasma concentration of benzo- diazepine",
            "Special Considerations": "Pregnancy safety: Category C. To minimize the likelihood of injection site pain, administer through an IV infusion established in a large vein. Be prepared to manage seizures in patients who are physically dependent on benzodiazepines to control seizures or who have ingested large doses of other drugs. Flumazenil may precipitate withdrawal syndromes in patients who are dependent on benzodiazepines. Patients should be monitored for possible re- sedation, respiratory depression, or other residual benzodiazepine effects. Be prepared to establish and assist ventilation"
        },

        {
            "Name": "FUROSEMIDE (Lasix)",
            "Class": "Loop diuretic.",
            "Mechanism Of Action": "Inhibits electrolyte reabsorption and promotes excretion of sodium, potassium, chloride.",
            "Indications": "CHF; Pulmonary edema",
            "Contraindications": "Hypovolemia, anuria, hypotension (relative contraindication); hypersensitivity, hepatic coma",
            "Adverse Reactions": "May exacerbate Hypovolemia, hypokalemia, ECG changes, dry mouth, hypochloremia, hyponatremia",
            "Drug Interactions": "Lithium toxicity may be potentiated by sodium depletion. Digitalis toxicity may be potentiated by potassium depletion.",
            "Adult Dosage": "0.5-1.0 mg/kg injected slowly IV. (Medical Control Option)",
            "Pediatric Dosage": "1 mg/kg / dose IV, IO. (Medical Control Option)",  
            "Duration Of Action": "Onset: 5 minutes.. Peak Effects: 20-60 minutes. Duration: 4-6 hours.",
            "Special Considerations": "Pregnancy safety: Category C. Ototoxicity and deafness can occur"
        },

        {
            "Name": "GLUCAGON",
            "Class": "Hyperglycemic agent, pancreatic hormone,",
            "Mechanism Of Action": "Increases blood glucose by stimulating glycolysis.. Unknown mechanism of stabilizing cardiac rhythm in beta-blocker overdose. Minimal positive inotrope and chronotrope.",
            "Indications": "Altered level of consciousness when hypoglycemia is suspected. May be used as inotropic agent in beta-blocker overdose.",
            "Contraindications": "Altered level of consciousness when hypoglycemia is suspected. May be used as inotropic agent in beta-blocker overdose.",
            "Adverse Reactions": "Nausea, vomiting. Tachycardia, hypertension.",
            "Drug Interactions": "Incompatible in solution with most other substances. No significant drug interactions with other emergency medications.",
            "Adult Dosage": "Hypoglycemia: 0.5 - 1 mg IM, SC, or slow IV; may repeat q 20 minutes PRN. Beta Blocker OD: 2-5mg titrated to effect",
            "Pediatric Dosage": "Hypoglycemia: 0.1 mg/kg / dose (not to exceed 1 mg) q 20 min. IM, IO, SC, slow IV. Nasal administration may be permitted by the State Treatment Protocols in certain cases.",  
            "Duration Of Action": "Onset: I minute. Peak effect: 30 minutes. Duration: Variable (generally 9-17 minutes).",
            "Special Considerations": "Pregnancy safety: Category C. Ineffective if glycogen stores depleted."
        },

        {
            "Name": "GLUCOSE - ORAL",
            "Class": "Hyperglycemic.",
            "Mechanism Of Action": "Provides quickly absorbed glucose to increase blood glucose levels.",
            "Indications": "Conscious patients with suspected hypoglycemia.",
            "Contraindications": "Decreased level of consciousness, nausea, vomiting.",
            "Adverse Reactions": "Nausea, vomiting.",
            "Drug Interactions": "None.",
            "Adult Dosage": "1 tube oral glucose 17-25g depending on brand",
            "Pediatric Dosage": "1 tube oral glucose 17-25g depending on brand",  
            "Duration Of Action": "Onset: Immediate. Peak Effect: Variable. Duration: Variable.",
            "Special Considerations": ""
        },

        {
            "Name": "HALOPERIDOL (Haldol)",
            "Class": "Tranquilizer, antipsychotic",
            "Mechanism Of Action": " Inhibits CNS catecholamine receptors: strong antidopaminergic and weak anticholinergic. Acts on the CNS to depress subcortical areas, midbrain, and ascending reticular activating system in the brain.",
            "Indications": "Acute psychotic episodes.",
            "Contraindications": "Hypersensitivity to the drug, depressed mental status and agitation secondary to shock and hypoxia, Parkinson’s Disease.",
            "Adverse Reactions": "Extrapyramidal reactions, seizures, sedation, confusion, insomnia, restlessness, dry mouth, hypotension, tachycardia, dystonia, respiratory depression, QT prolongation, cardiac arrest.",
            "Drug Interactions": "Enhanced CNS depression and hypotension in combination with alcohol. Other CNS depressants may potentiate effects.",
            "Adult Dosage": "5mg IM",
            "Pediatric Dosage": "Not recommended",  
            "Duration Of Action": "Onset: 10 minutes. Peak effects: 30-45 minutes. Duration: Variable (generally 12-24 hours)",
            "Special Considerations": " Pregnancy: Category C. Use during pregnancy only if maternal benefit outweighs fetal risk, especially during the 3rd trimester. Treat hypotension secondary to haloperidol with fluids and Norepinephrine, NOT Epinephrine."
        },

        {
            "Name": "HEPARIN SODIUM",
            "Class": "Anticoagulant.",
            "Mechanism Of Action": "Prevents conversion of fibrinogen to fibrin and affect clotting factors: IX, XI, XII, plasmin. Does not lyse existing clots.",
            "Indications": "Prophylaxis and treatment of venous thrombosis, pulmonary embolus, coronary occlusion, disseminated intravascular coagulation (DIC), post-operative thrombosis. To maintain patency of IV injection devices and indwelling catheters.",
            "Contraindications": "Hypersensitivity. Patients on antiplatelet drugs (relative contraindication).",
            "Adverse Reactions": "Hemorrhage, thrombocytopenia, allergic reactions (chills, fever, back pain).",
            "Drug Interactions": "Salicylates, some antibiotics and quinidine may increase risk of bleeding.",
            "Adult Dosage": "Loading dose: 80 units/kg IV; maintenance dose: 18 units/kg/hour IV.",
            "Pediatric Dosage": " Loading dose: 50 u/kg IV; maintenance dose: 7.5 units/kg/hour IV",  
            "Duration Of Action": "Onset: Immediate. Peak Effect: Variable. Duration: 4 hours after continuous infusion discontinued.",
            "Special Considerations": ""
        },

        {
            "Name": "HYDROCORTISONE/METHYLPREDNISOLONE (Solu-Cortef, Solu-Medrol)",
            "Class": "Corticosteroid.",
            "Mechanism Of Action": "Suppresses acute and chronic inflammation Replaces absent glucocorticoids Immunosuppressive effects.",
            "Indications": "Asthma, anaphylaxis, croup, Adrenal insufficiency",
            "Contraindications": "Hypersensitivity to product.",
            "Adverse Reactions": "Hypertension, sodium and water retention, GI bleeding, TB. None from single dose.",
            "Drug Interactions": "Calcium",
            "Adult Dosage": "Hydrocortisone: 2 mg./kg. IV bolus to maximum of 100 mg.; 100 mg. in adult. Methylprednisolone: 2 mg./kg/ IV bolus to maximum of 125 mg.; 125 mg. in adult.",
            "Pediatric Dosage": "",  
            "Duration Of Action": "Onset: Minutes to Hours (depending on indication). Peak effects: 8-12 hours.",
            "Special Considerations": "Protect medication from heat. Toxicity and side effects with long-term use."
        },

        {
            "Name": "HYDROXOCOBALAMIN (Vitamin B 12)",
            "Class": "Water soluble Vitamin",
            "Mechanism Of Action": "Cyanide is an extremely toxic poison. In the absence of rapid and adequate treatment, exposure to a high dose of cyanide can result in death within minutes due to the inhibition of cytochrome oxidase resulting in arrest of cellular respiration. Specifically, cyanide binds rapidly with cytochrome a3, a component of the cytochrome c oxidase complex in mitochondria. Inhibition of cytochrome a3 prevents the cell from using oxygen and forces anaerobic metabolism, resulting in lactate production, cellular hypoxia and metabolic acidosis. In massive acute cyanide poisoning, the mechanism of toxicity may involve other enzyme systems as well. Signs and symptoms of acute systemic cyanide poisoning may develop rapidly within minutes, depending on the route and extent of cyanide exposure. The action of hydroxocobalamin in the treatment of cyanide poisoning is based on its ability to bind cyanide ions. Each hydroxocobalamin molecule can bind one cyanide ion by substituting it for the hydroxo ligand linked to the trivalent cobalt ion, to form cyanocobalamin, which is then excreted in the urine.",
            "Indications": "Hydroxocobalamin is indicated for the treatment of known or suspected cyanide poisoning",
            "Contraindications": "None",
            "Adverse Reactions": "Serious adverse reactions with hydroxocobalamin include allergic reactions and increases in blood pressure. Use caution in the management of patients with known anaphylactic reactions to hydroxocobalamin or cyanocobalamin. Consideration should be given to use of alternative therapies, if available. Many patients with cyanide poisoning will be hypotensive; however, elevations in blood pressure have also been observed in known or suspected cyanide poisoning victims. Elevations in blood pressure (≥180 mmHg systolic or ≥110 mmHg diastolic) were observed in approximately 18% of healthy subjects (not exposed to cyanide) receiving hydroxocobalamin 5g and 28% of subjects receiving 10 g. Increases in blood pressure were noted shortly after the infusions were started; the maximal increase in blood pressure was observed toward the end of the infusion. These elevations were generally transient and returned to baseline levels within 4 hours of dosing.",
            "Drug Interactions": "No formal drug interaction studies have been conducted with hydroxocobalamin",
            "How Supplied": "Hydroxocobalamin is supplied in vials containing 2.5 grams of hydroxocobalamin which are to be diluted in 100 ml of normal saline. Hydroxocobalamin is given as a 5 gram IV dose.",
            "Adult Dosage": " 5 g (i.e., both 2.5g vials) administered as an intravenous (IV) infusion over 15 minutes (approximately 15 mL/min), i.e., 7.5 minutes/vial. Depending upon the severity of the poisoning and the clinical response, a second dose of 5 g may be administered by IV infusion for a total dose of 10 g. The rate of infusion for the second dose may range from 15 minutes (for patients in extremis) to two hours, as clinically indicated.",
            "Pediatric Dosage": "70 mg/kg. This dose should be given over 15 minutes.",  
            "Duration Of Action": "",
            "Special Considerations": "Pregnancy Category C. Emergency Patient Management: In addition to Cyanokit, treatment of cyanide poisoning must include immediate attention to airway patency, adequacy of oxygenation and hydration, cardiovascular support, and management of any seizure activity. Consideration should be given to decontamination measures based on the route of exposure. Use with other cyanide antidotes: Caution should be exercised when administering other cyanide antidotes simultaneously with Hydroxocobalamin, as the safety of co-administration has not been established. If a decision is made to administer another cyanide antidote with Hydroxocobalamin, these drugs should not be administered concurrently in the same IV line. Preparation of Solution for Infusion. Each 2.5 g vial of hydroxocobalamin for injection is to be reconstituted with 100 mL of diluent (not provided with Cyanokit) using the supplied sterile transfer spike. The recommended diluent is 0.9% Sodium Chloride injection (0.9% NaCl). Lactated Ringers injection and 5% Dextrose injection (D5W) have also been found to be compatible with hydroxocobalamin and may be used if 0.9% NaCl is not readily available. The line on each vial label represents 100 mL volume of diluent. Following the addition of diluent to the lyophilized powder, each vial should be repeatedly inverted or rocked, not shaken, for at least 30 seconds prior to infusion. Hydroxocobalamin solutions should be visually inspected for particulate matter and color prior to administration. If the reconstituted solution is not dark red or if particulate matter is seen after the solution has been appropriately mixed, the solution should be discarded."
        },


        {
            "Name": "HYDROMORPHONE (Dilaudid)",
            "Class": "Analgesic; opiate agonist",
            "Mechanism Of Action": "Hydromorphone is a semisynthetic analog of morphine used to relieve moderate to severe pain in cancer, surgery, trauma, burn, and cardiac patients. The drug works at opioid receptors to produce analgesia and euphoria. It may also produce respiratory depression, miosis, decreased gastrointestinal motility, and physical dependence. Hydromorphone is a schedule II-controlled substance.",
            "Indications": "Moderate to severe pain Analgesia, Preoperative medication",
            "Contraindications": "Asthma, GI obstruction, Hypersensitivity to narcotics, Respiratory depression, Status asthmaticus",
            "Adverse Reactions": "Respiratory depression, Nausea and vomiting, Euphoria, Delirium, Agitation, Hallucination Seizures, Headache, Hypotension, Visual disturbances, Coma, Facial flushing, Circulatory collapse, Dysrhythmias, Allergic reaction, Drowsiness, Rash",
            "Drug Interactions": "Respiratory depression, hypotension, or sedation may be potentiated by central nervous system depressants. Therapeutic doses of hydromorphone have caused additive CNS or respiratory depression and hypotension in patients taking MAO inhibitors.",
            "Adult Dosage": "1-2 mg SC/IM or slow IV every 6 hr.; titrate to pain relief",
            "Pediatric Dosage": " (>50 kg): 1 mg IV/SC every 4 hr.(<50 kg or >6 months of age): 0.015-0.02 mg/kg IV/SC every 2-4 hr; titrate to pain relief.",  
            "Duration Of Action": "Onset (IV/IM): Within 15min (dose related) Duration: 4-5 hr in nondependent patients",
            "Special Considerations": "Pregnancy safety: Category C. High potential for abuse, Use with extreme caution in patients with head trauma, increased intracranial pressure (ICP), or a preexisting seizure disorder. Use with caution in patients with cardiac dysrhythmias, hypotension, circulatory shock, or hypovolemia. Elderly patients may be more susceptible to adverse reactions. Can induce vasovagal syncope or orthostatic hypotension. Naloxone should be readily available."
        },

        {
            "Name": "IPRATROPIUM BROMIDE (Atrovent)",
            "Class": "Bronchodilator",
            "Mechanism Of Action": "Blocks the action of acetylcholine at the parasympathetic sites in bronchial smooth muscle causing bronchodilation.",
            "Indications": "Used in bronchospasm especially associated with COPD, and emphysema.",
            "Contraindications": "Hypersensitivity to atropine or its derivatives.",
            "Adverse Reactions": "Ipratropium is poorly absorbed from the lung, so systemic effects are rare. >10% CNS: Dizziness, Headache, Nervousness. Respiratory: Cough.1-10% Cardiac: Hypotension, palpitations",
            "Drug Interactions": "",
            "Adult Dosage": "0.5mg via Neb, usually mixed neb solution with 2.5mg Albuterol",
            "Pediatric Dosage": "250mcg via NEB may mix neb solution with Albuterol",  
            "Duration Of Action": "Onset: 1-3 minutes after administration Peak effects: Within 1.5- 2 hours Duration of Action: Up to 4-6 hours T1/2: 2 hrs after inhalation",
            "Special Considerations": "Pregnancy Safety: Category B."
        },

        {
            "Name": "KETAMINE (Ketalar)",
            "Class": "Sedative, analgesic dissociative anesthetic",
            "Mechanism Of Action": "Blocks pain receptors and minimizes spinal cord activity, affecting the association pathways of the brain between the thalamus and the limbic system.",
            "Indications": "Excited delirium, pain management, procedural sedation",
            "Contraindications": "Hypersensitivity, conditions where hypertension could be dangerous to the patient’s care.",
            "Adverse Reactions": "Hypertension, dysrhythmia, bronchodilation, respiratory depression.",
            "Drug Interactions": " ketamine increases the effects of opiates, barbiturates, and nondepolarizing neuromuscular blockers.",
            "Adult Dosage": "Excited Delirium 4mg/kg IM only. Pain: 0.3-0.5 mg/kg IV, may repeat IV dose once in 10 minutes Or 1 mg/kg IM/IN, may repeat IM/IN dose once in 20 minutes. RSI: 2mg/kg IV. Analgesia and sedation for intubated patient: 1-2mg/kg IV every 30-45min (Not allowed in all systems – know your local protocols)",
            "Pediatric Dosage": "Not recommended",  
            "Duration Of Action": "Onset: 10 minutes. Peak Effect: 1-2- hours Duration: 2-6 hours",
            "Special Considerations": "Pregnancy Safety: Category C – Contraindicated for use during pregnancy. Use in caution in older patients due to a higher risk of renal and fatal. GI adverse reactions."
        },

        {
            "Name": "KETOROLAC (Toradol)",
            "Class": "Nonsteroidal anti inflammatory",
            "Mechanism Of Action": "Ketorolac is an anti-inflammatory drug that also exhibits peripherally acting non-narcotic analgesic activity by inhibiting prostaglandin synthesis.",
            "Indications": "Short-term management (less than 5 days) of moderate to severe pain",
            "Contraindications": "Hypersensitivity to the drug, Patients with allergies to aspirin or other nonsteroidal Anti-inflammatory drugs, Bleeding disorders, Renal failure, Active peptic ulcer disease",
            "Adverse Reactions": "Anaphylaxis from hypersensitivity, Edema, Sedation, Bleeding disorders, Rash, Nausea, Headache",
            "Drug Interactions": "",
            "Adult Dosage": "IM: 1 dose of 60 mg (for patients <65 years of age); 1 dose of 30 mg for patients >65 years of age, have renal impairment, and/or weigh less than 50 kg IV: 30 mg over 1 min (for patients <65 years of age or weigh less than 50 kg); one-half dose (15 mg) for patients >65 years of age, have renal impairment, and/or weigh less than 50 kg",
            "Pediatric Dosage": "Not recommended",  
            "Duration Of Action": "Onset: Within 10 min. Duration: 6-8 hr.",
            "Special Considerations": "Pregnancy safety: Category C. Solution is clear and slightly yellow. Use with caution and reduce dose when administering to elderly patients."
        },

        {
            "Name": "LIDOCAINE HCL (2%)",
            "Class": "Antidysrhythmic.",
            "Mechanism Of Action": "Decreases automaticity by slowing the rate of spontaneous Phase 4 depolarization.",
            "Indications": "Suppression of ventricular dysrhythmias (V-tach, VF, PVCs). Prophylaxis against recurrence after conversion from V-tach, VF.",
            "Contraindications": "Suppression of ventricular dysrhythmias (V-tach, VF, PVCs). Prophylaxis against recurrence after conversion from V-tach, VF.",
            "Adverse Reactions": "Slurred speech, seizures, altered mental status, confusion, lightheadedness, blurred vision, bradycardia.",
            "Drug Interactions": "Apnea induced with succinylcholine may be prolonged with high doses of Lidocaine. Cardiac depression may occur in conjunction with IV Dilantin. Metabolic clearance decreased in patients with liver disease or those patients taking beta-blockers.",
            "Adult Dosage": "Cardiac arrest VT/ VF: 1-1.5 mg/kg IV push; repeat dose 0.75 mg/kg to maximum dose of 3 mg/kg. After conversion to NSR, begin maintenance infusion at 2-4 mg/min. VT with pulse: 1-1.5 mg/kg IV Push; then 0.50 - 0.75 mg/kg q 3-5 min. to max. of 3 mg/kg, Begin maintenance infusion at 2-4 mg/min. ASAP.",
            "Pediatric Dosage": "VF or Pulseless V-tach: 1 mg/kg IV / IO per dose. Infusion: 20-50 mcg/kg/min. PVCs with pulse: 1 mg/kg IV / IO per dose. Infusion: 20-50 mcg/kg/min.",  
            "Duration Of Action": "Onset: 1-5 minutes. Peak Effect: 5-10 minutes. Duration: Variable. (15 min. - 2 hours)",
            "Special Considerations": "Pregnancy safety: Category B. Reduce maintenance infusions by 50% if patient is over 70 years of age, has liver disease, or is in CHF or shock. A 75-100 mg bolus maintains levels for only 20 minutes. If bradycardia occurs with PVCs, always treat the bradycardia with atropine, Exceedingly high doses of Lidocaine can result in coma or death."
        },

        {
            "Name": "LORAZEPAM (Ativan)",
            "Class": "Benzodiazepine, sedative, anticonvulsant.",
            "Mechanism Of Action": "Anxiolytic, anticonvulsant and sedative effects; suppresses propagation of seizure activity produced by foci in cortex, thalamus and limbic areas.",
            "Indications": "Initial control of status epilepticus or severe recurrent seizures. Severe anxiety. Sedation.",
            "Contraindications": "Coma, shock or suspected drug abuse.",
            "Adverse Reactions": "Respiratory depression, apnea, drowsiness, sedation, ataxia, psychomotor impairment, confusion. Restlessness, delirium. Hypotension, bradycardia.",
            "Drug Interactions": "May precipitate CNS depression if patient is already taking CNS depressant medications.",
            "Adult Dosage": "2-4 mg slow IV at 2 mg / min. or IM; may repeat in 15-20 minutes to maximum dose of 8 mg. For sedation: 0.05 mg/kg up to 4 mg IM.",
            "Pediatric Dosage": "0.05 - 0.20 mg/kg slow IV, IO slowly over 2 minutes or IM; may repeat in 15-20 minutes to maximum dose of 0.2 mg/kg.",  
            "Duration Of Action": "Onset of action: 1-5 minutes. Peak effect: variable. Duration of action: 6-8 hours.",
            "Special Considerations": "Pregnancy safety: Category D. Inadvertent arterial injection may result in vasospasm and gangrene. Lorazepam expires in 6 weeks if not refrigerated. Note: When given IV or IO, must dilute with equal volume of sterile water or sterile saline; When given IM, Lorazepam is not to be diluted.  Note from Drug Control Program: Re: Storage of Lorazepam. According to stability information, Lorazepam injection requires refrigeration and should be stored at 2 - 8o C (35 - 45o F). Lorazepam injection should be protected from light, which can be accomplished by retaining the vial in the carton until ready for use. In addition, freezing of the injection should be avoided. Ambulances are required to ensure stability of all drug products stored on site. Those ambulances unable to meet the above-mentioned storage conditions should refrain from using Lorazepam. For further information, contact the Drug Control Program at (617) 983-6700 or the Office of Emergency Medical Services at (617) 753-7300."
        },

        {
            "Name": "MAGNESIUM SULFATE",
            "Class": "Electrolyte.",
            "Mechanism Of Action": "Reduces striated muscle contractions and blocks peripheral neuromuscular transmission by reducing acetylcholinesterase release at the myoneural junction; manages seizures in toxemia of pregnancy; induces uterine relaxation; can cause bronchodilation after beta agonists and anticholinergics have been used.",
            "Indications": "Acute Asthma / Bronchospasm, Seizures of eclampsia (Toxemia of pregnancy). Torsades de Pointes. Hypomagnesemia. TCA overdose-induced dysrhythmias. Digitalis-induced dysrhythmias. Class IIa agent for refractory VF and VT after administration of Amiodarone",
            "Contraindications": "Heart blocks. Renal diseases.",
            "Adverse Reactions": "Respiratory and CNS depression. Hypotension, cardiac arrest and asystole may occur. Facial flushing, diaphoresis, depressed reflexes. Circulatory collapse.",
            "Drug Interactions": "May enhance effects of other CNS depressants. Serious changes in overall cardiac function may occur with cardiac glycosides.",
            "Adult Dosage": "Seizure activity associated with pregnancy: 1-4 gm IV over 10 minutes. Torsades de Pointes or Refractory VF/VT: 1-2 grams IV over 1-2 minutes. For Bronchospasm: 2-4 gm IV in 100ml of NS over 5 minutes",
            "Pediatric Dosage": "Asthma/bronchospasm, severe: 25-50 mg/kg. over 10 minutes IV. Usually mixed in 50-100ml of NS to be given IV.",  
            "Duration Of Action": "Onset: Immediate. Peak effect: variable. Duration: 3-4 hours.",
            "Special Considerations": "Pregnancy safety: Recommended that drug not be given in the 2 hours before delivery, if possible. IV calcium gluconate or calcium chloride should be available as antagonist if needed. Use with caution in patients with renal failure. Magnesium sulfate is being used for acute MI patients in some systems under Medical Direction."
        },

        {
            "Name": "MANNITOL 20%",
            "Class": "Osmotic diuretic",
            "Mechanism Of Action": "Promotes the movement of fluid form the intracellular space to the extracellular space. Decreases cerebral edema and intracranial pressure. Promotes urinary excretion of toxins.",
            "Indications": "Cerebral edema. Reduce intracranial pressure for certain cause (space occupying lesions). Rhabdomyolysis (myoglobinuria). Blood transfusion reactions.",
            "Contraindications": "Hypotension, renal failure, electrolyte depletion, dehydration, intracranial bleeding. Severe CHF with pulmonary edema, hyponatremia.",
            "Adverse Reactions": "CHF, pulmonary edema, hypertension, nausea, vomiting, headache, seizures, chest pain, tachycardia. Electrolyte depletion, dehydration, hypotension, sodium depletion.",
            "Drug Interactions": "May precipitate digitalis toxicity in when given concurrently.",
            "Adult Dosage": "0.50g - 2 g / kg IV infusion over 15-30 minutes; may repeat after 5 minutes if no effect.",
            "Pediatric Dosage": "0.5 - 1g / kg / dose IV, IO infusion over 30-60 minutes; may repeat after 30 minutes if no effect.",  
            "Duration Of Action": "Onset: 1-3 hours for diuretic effect; 15 minutes for reduction of intracranial pressure. Peak effect: variable. Duration: 4-6 hours for diuretic effect; 3-8 hours for reduction of ICP.",
            "Special Considerations": "Pregnancy safety: Category C. May crystallize at temperatures below 7.8 degrees Centigrade. In-line filter should always be used. Effectiveness depends upon large doses and an intact blood-brain barrier. Usage and dosages in emergency care are controversial."
        },

        {
            "Name": "MEPERIDINE (Demerol)",
            "Class": "Opioid Analgesic",
            "Mechanism Of Action": "Synthetic opioid agonist that acts on opioid receptors to produce analgesia, euphoria, respiratory and physical depression; a schedule II drug with potential for physical dependency and abuse.",
            "Indications": "Analgesia for moderate to severe pain.",
            "Contraindications": "Hypersensitivity to narcotic agents. Diarrhea caused by poisoning. Patients taking MAOIs. During labor or delivery of a premature infant. Undiagnosed abdominal pain or head injury.",
            "Adverse Reactions": "Respiratory depression, sedation, apnea, circulatory depression, dysrhythmias, shock, euphoria, delirium, agitation, hallucinations, visual disturbances, coma. Seizures, headache, facial flushing. Increased ICP, nausea, vomiting.",
            "Drug Interactions": "Do not give concurrently with MAOIs (even with a dose in the last 14 days!). Exacerbates CNS depression when given with these medications.",
            "Adult Dosage": "50-100 mg IM, SC or 25 - 50 mg slowly IV.",
            "Pediatric Dosage": "1-2 mg/kg / dose IV, IO, IM, SC.",  
            "Duration Of Action": "Onset: IM: 10-45 minutes; IV: immediate. Peak effect: 30-60 minutes. Duration: 2-4 hours.",
            "Special Considerations": ""
        },

        {
            "Name": "METOPROLOL (Lopressor)",
            "Class": "Beta Blocker",
            "Mechanism Of Action": "Selective inhibitor of beta1-adrenergic receptors; completely blocks beta1 receptors, with little or no effect on beta 2 receptors at doses <100 mg;",
            "Indications": "Atrial fibrillation, Atrial flutter",
            "Contraindications": "Hypersensitivity to metoprolol or any component of the formulation; sinus bradycardia; heart block greater than first degree (except in patients with a functioning artificial pacemaker); cardiogenic shock; uncompensated cardiac failure; pregnancy (2nd and 3rd trimesters)",
            "Adverse Reactions": "Respiratory: Bronchospasm Cardiovascular: Bradycardia, palpitations, edema, congestive heart failure, reduced peripheral circulation. Central nervous system: Drowsiness, insomnia.",
            "Drug Interactions": "Drugs which slow AV conduction (digoxin): effects may be additive with beta-blockers. Glucagon: Metoprolol may blunt the hyperglycemic action of glucagon. Verapamil or diltiazem may have synergistic or additive pharmacological effects when taken concurrently with beta-blockers; avoid concurrent I.V. use.",
            "Adult Dosage": "5 mg over 1- 2 minutes slow IVP (Medical Control Option) May repeat every 5 minutes to a maximum of 15mg",
            "Pediatric Dosage": "Not recommended",  
            "Duration Of Action": "",
            "Special Considerations": "Pregnancy Safety: Category C (manufacturer); D (2nd and 3rd trimesters - expert analysis) Not recommended in pediatric population. The safety and effectiveness of Metoprolol have not been established in children"
        },

        {
            "Name": "MIDAZOLAM (Versed)",
            "Class": "Short-acting benzodiazepine CNS depressant.",
            "Mechanism Of Action": "Short-acting benzodiazepine CNS depressant.",
            "Indications": "Status Seizure Sedation, Anxiolytic prior to endotracheal or nasotracheal intubation. Administer for conscious sedation.",
            "Contraindications": "Glaucoma, shock, coma, alcohol intoxication, overdose patient. Depressed vital signs. Concomitant use with other CNS depressants, barbiturates, alcohol, narcotics.",
            "Adverse Reactions": "Hiccough, cough, over-sedation, nausea, vomiting, injection site pain, headache, blurred vision. Hypotension, respiratory depression and arrest.",
            "Drug Interactions": "Should not be used in patients who have taken CNS depressant.",
            "Adult Dosage": "IV: 2-6 mg slow IV push; (may be repeated to total maximum: 0.1 mg/kg). IN for seizure 10mg",
            "Pediatric Dosage": "To facilitate intubation: Medical control may order: (6 months- 5 years) Use of Midazolam 0.05-0.1 mg/kg IV maximum dose of 5 mg. (6-12 years old) Use of Midazolam 0.1 mg/kg IV maximum dose of 8 mg.",  
            "Duration Of Action": "Onset: 1-3 minutes IV and dose dependent. Peak effect: variable. Duration: 2-6 hours and dose dependent.",
            "Special Considerations": "Pregnancy safety: category D. Administer immediately prior to intubation procedure. Requires continuous monitoring of respiratory and cardiac function. WMD: (See APPENDIX Dosing Table) Nasal administration may be permitted by the State Treatment Protocols in certain cases."
        },

        {
            "Name": "MORPHINE SULFATE",
            "Class": "Opioid analgesic. (Schedule II drug).",
            "Mechanism Of Action": "Alleviates pain through CNS actions. Suppresses fear and anxiety centers in brain. Depresses brain stem respiratory centers. Decreases preload and afterload, decreasing myocardial oxygen demand.",
            "Indications": "Analgesia for moderate to severe acute and chronic pain (use with caution). Severe CHF, pulmonary edema. Chest pain associated with acute MI.",
            "Contraindications": "Head injury, exacerbated COPD, depressed respiratory drive, hypotension undiagnosed abdominal pain, decreased level of consciousness. Suspected hypovolemia.",
            "Adverse Reactions": "Respiratory depression, hypotension, decreased level of consciousness, nausea, vomiting. Bradycardia, tachycardia, syncope, facial flushing, euphoria, bronchospasm, dry mouth.",
            "Drug Interactions": "CNS depressant may potentate effects of morphine.",
            "Adult Dosage": "0.1 mg/kg to a maximum of 10 mg IV/IM/SC",
            "Pediatric Dosage": "0.1 - 0.2 mg/kg / dose IV, IO, IM, SC every 5 minutes titrated to max. of 5 mg.",  
            "Duration Of Action": "Onset: Immediate. Peak effect: 20 minutes. Duration: 2 - 7 hours.",
            "Special Considerations": "Pregnancy safety: Category C. Morphine rapidly crosses the placenta. Safety in neonate not established. Use with caution in geriatric population and those with COPD, asthma. Naloxone should be readily available as antidote."
        },

        {
            "Name": "NALOXONE (Narcan)",
            "Class": "Narcotic antagonist.",
            "Mechanism Of Action": "Competitive inhibition at narcotic receptor sites. Reverse respiratory depression secondary to depressant drugs. Completely inhibits the effect of morphine.",
            "Indications": "Respiratory Depression Secondary to Opiate overdose. Complete or partial reversal of CNS and respiratory depression induced by opioids. Narcotic agonist: Morphine, heroin, hydromorphone (Dilaudid), methadone. Meperidine (Demerol), Paregoric, Fentanyl (Sublimase). Oxycodone (Percodan), codeine, propoxyphene (Darvon). Narcotic agonist and antagonist Butorphanol (Stadol). Pentazocine (Talwin). Nalbuphine (Nubain).",
            "Contraindications": "Use with caution in narcotic-dependent patients. Use with caution in neonates of narcotic-addicted mothers.",
            "Adverse Reactions": "Withdrawal symptoms in the addicted patient. Tachycardia, hypertension, dysrhythmias, nausea, vomiting, diaphoresis.",
            "Drug Interactions":"",
            "Adult Dosage":  "0.4 - 2.0 mg IV, IM, SC, Nasal via atomizer); min. recommended = 2.0 mg repeat at 5 minute intervals to 10 mg maximum dose. (Medical Control may request higher amounts). Infusion: 2 mg in 500 ml of D5W (4 mcg/ml), infuse at 0.4 mg / hr. (100 ml/hour).",
            "Pediatric Dosage": "0.1 mg/kg / dose IV, IM, SC, ET (diluted); maximum of 0.8 mg; if no response in 10 minutes, administer an additional 0.1 mg/kg /dose.",  
            "Duration Of Action": "Onset: within 2 minutes. Peak effect: variable. Duration: 30-60 minutes.",
            "Special Considerations": "Pregnancy safety: category B. Seizures without causal relationship have been reported. May not reverse hypotension. Use caution when administering to narcotic addicts (violent behavior, etc.)."
        },

        {
            "Name": "NITROGLYCERIN",
            "Class": "Vasodilators.",
            "Mechanism Of Action": "Smooth muscle relaxant acting on vascular, bronchial, uterine and intestinal smooth muscle. Dilation of arterioles and veins in the periphery, reduces preload and afterload, decreases the workload of the heart and, thereby, myocardial oxygen demand.",
            "Indications": "Acute angina pectoris. Ischemic chest pain. CHF, pulmonary edema.",
            "Contraindications": "Hypotension, hypovolemia. Intracranial bleeding or head injury.",
            "Adverse Reactions": "Headache, hypotension, syncope, reflex tachycardia, flushing. Nausea, vomiting, diaphoresis, muscle twitching.",
            "Drug Interactions": "Additive effects with other vasodilators.",
            "Adult Dosage": "Tablets: 0.3 mg SL; may repeat in 3-5 minutes to maximum of 3 doses. NTG spray: 0.4 mg on or under the tongue; 1-2 sprays, may repeat in 3-5 minutes",
            "Pediatric Dosage": "Not recommended.",  
            "Duration Of Action": "Onset: 1-3 minutes. Peak effect: 5-10 minutes. Duration: 20-30 minutes or if IV, 1-10 minutes after discontinuation of infusion.",
            "Special Considerations": "Pregnancy safety: category C. Hypotension more common in geriatric population. NTG decomposes if exposed to light or heat. Must be kept in airtight containers.  Active ingredient may have a stinging effect when administered SL."
        },

        {
            "Name": "NITROPASTE",
            "Class": "Vasodilator",
            "Mechanism Of Action": "Smooth muscle relaxant acting on vascular, bronchial, uterine and intestinal smooth muscle. Dilation of arterioles and veins in the periphery reduces preload and afterload, decreases the workload of the heart and, thereby, myocardial oxygen demand.",
            "Indications": "Angina pectoris and chest pain associated with acute MI, CHF/PE; Hypertension (HTN).",
            "Contraindications": "Hypotension, hypovolemia, Intracranial bleeding or head injury.",
            "Adverse Reactions": "Headache, hypotension, syncope, reflex tachycardia, flushing. Nausea, vomiting, diaphoresis, muscle twitching.",
            "How Supplied": "Topical Ointment: (Nitrolâ) 2% [20 mg/g] (30g, 60g)",
            "Drug Interactions": "",
            "Adult Dosage": "For CHF/PE; HTN, Paste: Apply 1 inch, cover with plastic wrap and secure with tape.",
            "Pediatric Dosage": "Not recommended.",  
            "Duration Of Action": "Onset: 30 minutes. Peak effect: Variable. Duration: 18-24 hours.",
            "Special Considerations": "Pregnancy safety: Category C. Apply in thin uniform layer on non-hairy area. 1-inch equals approximately 15 mg nitroglycerin. Avoid using fingers to spread paste. Store past in cool place with tube tightly capped. Erratic absorption rates quite common."
        },

        {
            "Name": "NOREPINEPHRINE (Levophed)",
            "Class": "Vasopressor",
            "Mechanism Of Action": "Potent alpha-agonist resulting in intense peripheral vasoconstriction, positive chronotropic and increased inotropic effect with increased cardiac output. Aplha adrenergic activity resulting in peripheral vasoconstriction and beta-adrenergic activity leading to inotropic stimulation of the heart and coronary artery vasodilation.",
            "Indications": "Cardiogenic shock unresponsive to fluid resuscitation, significant hypotension (<70 mm/Hg) states, first line vasopressor in septic shock.",
            "Contraindications": "Hypotensive patients with hypovolemia, pregnancy (relative). Adverse Reactions: Headache, anxiety, dizziness, restlessness, dyspnea, bradycardia, hypertension, dysrhythmias, chest pain, peripheral cyanosis, cardiac arrest, nausea, vomiting, urinary retention, renal failure, decreased blood flow to the GI tract, kidneys and skeletal muscle and skin, tissue necrosis from extravasation.",
            "Adverse Reactions": "",
            "Drug Interactions": "Can be deactivated by alkaline solutions. Sympathomimetic and phosphodiesterase inhibitors may exacerbate dysrhythmias.",
            "Adult Dosage": "0.1-0.5 mcg/kg/min titrating to a BP of 90 systolic.",
            "Pediatric Dosage": "0.1-2 mcg/kg/min, titrate rate to achieve desired change in BP and systemic perfusion.",  
            "Duration Of Action": "Onset: 1-3 minutes, Peak Effect: Variable, Duration: 5-10 minutes. Effects last only 1 minute after infusion discontinued.",
            "Special Considerations": "Pregnancy Safety: Category C. Use cautiously during pregnancy and while breastfeeding. May cause fetal anoxia when used in pregnancy. Infuse norepinephrine through a large, stable vein to avoid extravasation and tissue necrosis. Drug or poison induced hypotension may require higher doses to achieve adequate perfusion."
        },

        {
            "Name": "ONDANSETRON (Zofran)",
            "Class": "Antiemetic",
            "Mechanism Of Action": "Selective 5-HT receptor antagonist, blocking serotonin, both peripherally on vagal nerve terminals and centrally in the CNS chemoreceptor trigger zone",
            "Indications": "Treatment and prevention of nausea and vomiting",
            "Contraindications": "Hypersensitivity to ondansetron, other selective 5-HT3 antagonists, or any component of the formulation, Prolonged QT interval",
            "Adverse Reactions": "Headache, drowsiness, pruritus, prolonged QT",
            "Drug Interactions": "",
            "Adult Dosage": "4-8 mg IV or PO",
            "Pediatric Dosage": " ≤30 kg: 1 mg IV; ≤30 kg: 2 mg IV.",  
            "Duration Of Action": "Onset of action: ~30 minutes Half-life elimination: Children <5 years: 2-3 hours; Adults: 3-6 hours",
            "Special Considerations": "Pregnancy safety: Category B, Do NOT give in pts with prolonged QT interval"
        },

        {
            "Name": "OXYGEN",
            "Class": "Naturally occurring atmospheric gas.",
            "Mechanism Of Action": "Reverses hypoxemia.",
            "Indications": "Confirmed or expected hypoxemia. Ischemic chest pain. Respiratory insufficiency. Prophylactically during air transport. Confirmed or suspected carbon monoxide poisoning. All other causes of decreased tissue oxygenation. Decreased level of consciousness.",
            "Contraindications": "Certain patients with COPD, emphysema who will not tolerate Oxygen concentrations over 35%. Hyperventilation.",
            "Adverse Reactions": "Decreased level of consciousness and respiratory depression in patients with chronic CO2 retention. Retrolental fibroplasia if given in high concentrations to premature infants. (maintain 30-40% 02)",
            "Drug Interactions": "None.",
            "How Supplied": "Oxygen cylinders (usually green and white) of 100% compressed oxygen gas).",
            "Adult Dosage": "Cardiac arrest and Carbon Monoxide poisoning: 100%. Hypoxemia: 10-15 L/ min. via non-rebreather. COPD: 0-2 L/ min. via nasal cannula or 28-35% venturi mask. Be prepared to provide ventilatory support if higher concentrations of oxygen needed.",
            "Pediatric Dosage": "Same as for adult with exception of premature infant.",  
            "Duration Of Action": "Onset: Immediate. Peak effect: not applicable. Duration: Less than 2 minutes.",
            "Special Considerations": "Be familiar with liter flow and each type of delivery device used. Supports possibility of combustion."
        },

        {
            "Name": "PANCURONIUM (Pavulon)",
            "Class": "Neuromuscular blocker (non-depolarizing)",
            "Mechanism Of Action": "Pancuronium produces complete muscular relaxation by binding to the receptor for acetylcholine at the neuromuscular junction, without initiating depolarization of the muscle membrane. As the concentration of acetylcholine rises in the neuromuscular junction, Pancuronium is displaced and muscle tone is regained.",
            "Indications": "In emergency care, Pancuronium is used to optimize conditions for endotracheal intubation and assisted ventilations. Induction or maintenance of paralysis after intubation to assist ventilations.",
            "Contraindications": "Known hypersensitivity to the drug. Inability to control airway and/or support ventilations with oxygen and positive pressure Neuromuscular disease (e.g., myasthenia gravis)",
            "Adverse Reactions": "Transient hypotension Tachycardia, Dysrhythmias, Hypertension, Excessive salivation, Pain, burning at IV injection site",
            "Drug Interactions": "Positive chronotropic drugs may potentiate tachycardia.",
            "Adult Dosage": "0.04-0.1 mg/kg slow IV; repeat q 30-60 min prn",
            "Pediatric Dosage": "0.04-0.1 mg/kg slow IV",
            "Newborn Dosage": "0.02 mg/kg dose", 
            "Duration Of Action": " Onset: Paralysis in 3-5 min Duration: 45-60 min",
            "Special Considerations": "Pregnancy safety: Category C, Patients must be sedated completely and have an artificial airway during paralysis. Carefully monitor the patient and be prepared to resuscitate. Pancuronium has no effect on consciousness or pain. Pancuronium will not stop neuronal seizure activity or decrease central nervous system damage caused by seizures. Heart rate and cardiac output will be increased. Pancuronium is excreted in the urine; doses should be decreased for patients with renal disease. Neuromuscular blocking agents result in respiratory paralysis. Therefore, intubation and ventilatory support must be readily available."
        },

        {
            "Name": "PRALIDOXIME CHLORIDE (2-PAM, Protopam)",
            "Class": "Cholinesterase reactivator",
            "Mechanism Of Action": "Reactivation of cholinesterase to effectively act as an antidote to organophosphate pesticide poisoning. This action allows for destruction of accumulated acetylcholine at the neuromuscular junction.",
            "Indications": "As an antidote in the treatment of poisoning by organophosphate pesticides and chemicals. In the pre-hospital arena, is used when atropine is or has become ineffective in management of organophosphate poisoning.",
            "Contraindications": "Use with caution in patients with reduced renal function. Patients with myasthenia gravis and organophosphate poisoning.",
            "Adverse Reactions": "Dizziness, blurred vision, diplopia, headache, drowsiness, nausea, tachycardia, hyperventilation, muscular weakness, excitement and manic behavior",
            "Drug Interactions": "No direct drug interactions, however, patients with organophosphate poisoning should not be given barbiturates, morphine, theophylline, aminophylline, succinylcholine, reserpine and phenothiazines.",
            "How Supplied": "Emergency Single Dose Kit containing: One 20 ml vial of 1gram sterile Protopam Chloride One 20 ml ampule of sterile diluent.Sterile, disposable 20 ml syringe.Needle and alcohol swab.",
            "Adult Dosage": "Initial dose of 1-2 grams as an IV infusion with 100 ml saline over 15-30 minutes.",
            "Pediatric Dosage": "20-40 mg/kg as IV infusion over 15-30 minutes. Doses may be repeated every 1 (one) hour if muscle weakness persists. If IV administration is not feasible, IM or SC injection may be utilized.",  
            "Duration Of Action": "Onset: Minutes Peak effects: Variable. Duration: Variable",
            "Special Considerations": "NOTE: If Protopam is to be used, administer almost simultaneously with atropine. Pregnancy safety: unknown. Treatment will be most effective if given within a few hours after poisoning. Cardiac monitoring should be considered in all cases of severe organophosphate poisoning."
        },

        {
            "Name": "PROCAINAMIDE (Pronestyl)",
            "Class": "Antidysrhythmic Class Ia",
            "Mechanism Of Action": "Suppresses phase IV depolarization in normal ventricular muscle and Purkinje fibers, reducing automaticity of ectopic pacemakers; suppresses reentry dysrhythmias by slowing intraventricular conduction.",
            "Indications": "Suppress PVCs refractory to Lidocaine. Suppress VT with a pulse refractory to Lidocaine. PSVTs with wide-complex tachycardia of unknown origin (drug of choice when associated with WP).",
            "Contraindications": "Second- and Third-Degree block, Torsades de Pointes, Lupus, Digitalis toxicity, Myasthenia gravis.",
            "Adverse Reactions": "PR, QRS, and QT widening, AV Block, cardiac arrest, hypotension, seizures. Nausea, vomiting, reflex tachycardia, PVCs, VT, VF. CNS depression, confusion.",
            "Drug Interactions": "",
            "Adult Dosage": "20-30 mg/min; maximum total dose is 17 mg/kg. Maintenance infusion: 1-4 mg/min.",
            "Pediatric Dosage": "2-6 mg/kg IV at less than 20 mg/min; maximum dose is 17mg/kg. Maintenance infusion: 20-80 micrograms/kg/min.",  
            "Duration Of Action": "Onset: 10-30 minutes. Peak effect: Variable. Duration: 3-6 hours.",
            "Special Considerations": ""
        },

        {
            "Name": "PROMETHAZINE (Phenergan)",
            "Class": "Phenothiazine, antihistamine",
            "Mechanism Of Action": "H receptor antagonist that blocks the actions of histamines by competitive antagonism at the H receptor. In addition to antihistamine effects, promethazine also possesses sedative, antimotion, antiemetic, and considerable anticholinergic activity.",
            "Indications": "Nausea and vomiting, Motion sickness, Preoperative and postoperative, obstetrical (during labor) sedation",
            "Contraindications": "Hypersensitivity, Comatose states, central nervous system depression from alcohol, barbiturates, or narcotics.",
            "Adverse Reactions": "Sedation, Dizziness, may impair mental and physical ability. Allergic reactions, Dysrhythmias, Nausea and vomiting. Hyperexcitability, and dystonias. Use in children may cause hallucinations, convulsions, and sudden death",
            "Drug Interactions": "Concomitant use of central nervous system depressants may have an additive sedative effect. Increased incidence of extrapyramidal effects occurs when given with some MAO inhibitors. Concomitant use of epinephrine may decrease blood pressure further.",
            "Adult Dosage": "IM: 12.5-25mg (undiluted) deep IM injection. IV: 6.25-25 mg slow IV (dilute in 9 mL of NaCl and give 25 mg or less over 10-15 min)",
            "Pediatric Dosage": "Age ≥2 years of age only IM: 0.25-0.5 mg/kg (up to a maximum of 25 mg) or IV: 0.2-0.5 mg IV (up to a maximum of 25 mg) slow IV (dilute in 9 mL of NaCl and give 25 mg or less over 10-15 min)",  
            "Duration Of Action": "Onset: IV (rapid) Duration: 4-6 hr.",
            "Special Considerations": "Pregnancy safety: Category C (generally considered safe for use during labor). Use caution in patients with asthma, peptic ulcer, and bone marrow depression. Take care to avoid accidental intraarterial injection. IM injections are the preferred route of administration."
        },

        {
            "Name": "RACEMIC EPINEPHRINE",
            "Class": "Sympathomimetic",
            "Mechanism Of Action": "Stimulates beta-2 receptors in the lungs: bronchodilation with relaxation of bronchial smooth muscles. Reduces airway resistance. Useful in treating laryngeal edema; inhibits histamine release.",
            "Indications": "Croup, laryngeal edema, bronchial asthma",
            "Contraindications": "Hypertension, underlying cardiovascular disease, epiglottitis.",
            "Adverse Reactions": "Headache, anxiety, fear, nervousness, respiratory weakness, palpitations, tachycardia, dysrhythmias, nausea, vomiting.",
            "Drug Interactions": "Beta blockers may blunt the effect. MAOIs may potentiate the effect.",
            "Adult Dosage": "11.25 mg (0.5 ml) Dilute 0.5 ml solution for inhalation with 2.5 ml normal saline in nebulizer",
            "Pediatric Dosage": "Same as adult dosing",  
            "Duration Of Action": "Onset: within 5 minutes.Peak Effect: 5-15 minutes Duration: 1-3 hours",
            "Special Considerations": "Pregnancy Safety: Category C. Excessive use may cause bronchospasm. May have a strong rebound effect after drug wears off."
        },

        {
            "Name": "ROCURONIUM (Zemuron)",
            "Class": "Neuromuscular blocker (non-depolarizing)",
            "Mechanism Of Action": "Rocuronium produces complete muscular relaxation by binding to the receptor for acetylcholine at the neuromuscular junction, without initiating depolarization of the muscle membrane. As the concentration of acetylcholine rises in the neuromuscular junction, Pancuronium is displaced and muscle tone is regained.",
            "Indications": "In emergency care, Rocuronium is used to optimize conditions for endotracheal intubation and assisted ventilations. Induction or maintenance of paralysis after intubation to assist ventilations.",
            "Contraindications": "Known hypersensitivity to bromides. Use with caution in pts with heart and liver disease. Inability to control airway and/or support ventilations with oxygen and positive pressure.",
            "Adverse Reactions": "Muscle paralysis apnea, dyspnea, respiratory depression, tachycardia, uritcaria",
            "Drug Interactions": "Positive chronotropic drugs may potentiate tachycardia.",
            "Adult Dosage": "0.6-1.2 mg/kg IV",
            "Pediatric Dosage": "0.9-1.2 mg/kg IV",  
            "Duration Of Action": "",
            "Special Considerations": "Pregnancy safety: Category C. Patients must be sedated completely and have an artificial airway during paralysis. Carefully monitor the patient and be prepared to resuscitate. Rocuronium has no effect on consciousness or pain. Rocuronium will not stop neuronal seizure activity or decrease central nervous system damage caused by seizures. Heart rate and cardiac output will be increased. Rocuronium is excreted in the urine; doses should be decreased for patients with renal disease. Neuromuscular blocking agents result in respiratory paralysis. Therefore, intubation and ventilatory support must be readily available."
        },

        {
            "Name": "SODIUM BICARBONATE 8.4%",
            "Class": "Buffer, alkalinizer.",
            "Mechanism Of Action": "Reacts with hydrogen ions to form water and carbon dioxide thereby acting as a buffer for metabolic acidosis.",
            "Indications": "Hyperkalemia. TCA overdose. Phenobarbital overdose. Known pre-existing bicarbonate-responsive acidosis.. Upon return of spontaneous circulation after long arrest interval. Alkalinization for treatment of specific intoxications.",
            "Contraindications": "Metabolic and respiratory alkalosis. Hypocalcemia and hypokalemia. Hypocloremia secondary to GI loss and vomiting.",
            "Adverse Reactions": "Metabolic alkalosis, hypokalemia, hyperosmolarity, fluid overload. Increase in tissue acidosis. Electrolyte imbalance and tetany, seizures. Tissue sloughing at injection site.",
            "Drug Interactions": "May precipitate in calcium solutions. Vasopressors may be deactivated.",
            "Adult Dosage": "1 mEq / kg IV; may repeat with 0.5 mEq / kg every 10 minutes.",
            "Pediatric Dosage": "Same as for adult.",  
            "Duration Of Action": "Onset: 2-10 minutes. Peak effect: 15-20 minutes. Duration: 30-60 minutes.",
            "Special Considerations": "Pregnancy safety: Category C. Must ventilate patient after administration. Intracellular acidosis may be worsened by production of carbon dioxide. May worsen CHF."
        },

        {
            "Name": "SUCCINYLCHOLINE (Anectine)",
            "Class": "Neuromuscular blocker, skeletal muscle relaxant.",
            "Mechanism Of Action": "Ultra short acting depolarizing skeletal relaxant that mimics acetylcholine as it binds with the cholinergic receptors on the motor end plate, producing a phase I block as manifested by fasiculations.",
            "Indications": "RSI",
            "Contraindications": "Penetrating eye injuries; malignant hyperthermia; hyperkalemic states; acute injury after multi-system trauma, major burns, or extensive muscle injury that may result in hyperkalemia.",
            "Adverse Reactions": " Apnea, respiratory depression, bradydysrhythmia, tachydysrhythmias, cardiac arrest, prolonged muscle rigidity, rhabdomyolosis, malignant hyperthermia, hyperkalemia",
            "Drug Interactions": "Oxytocin, beta-blockers, and organophosphates may potentiate effects. Diazepam may reduce the duration of action.",
            "Adult Dosage": "1-2 mg/kg rapid IV. Repeat once if needed.",
            "Pediatric Dosage": "2 mg/kg rapid IV. Repeat once if needed.",  
            "Duration Of Action": "Onset: 1 minute. Peak Effect: 1-3 minutes Duration: 5-10 minutes",
            "Special Considerations": "Pregnancy Safety: Category C. Appropriate sedation and analgesia should be used in any patient before undergoing neuromuscular blockade. Time management is crucial. Postintubation sedation and analgesia should be readily available."
        },

        {
            "Name": "TETRACAINE",
            "Class": "Local Anesthetic",
            "Mechanism Of Action": "Blocks the initiation and conduction of nerve impulses",
            "Indications": "Topically applied local anesthetic for eye examination",
            "Contraindications": "Hypersensitivity to ester anesthetics; Not to be applied in large amounts or to Infants of less than 1 year old.",
            "Adverse Reactions": "1-10% Dermal: Angioedema, burning, contact dermatitis, stinging. < 1%: Methemoglobinemia in infants",
            "Drug Interactions": "Ophthalmic: 0.5% [5mg/ml] (1ml, 2ml, 15ml)",
            "Adult Dosage": "Ophthalmic Solution: Instill 1-2 drops",
            "Pediatric Dosage": "Ophthalmic Solution: Instill 1-2 drops",  
            "Duration Of Action": "Onset: Within 60 seconds.",
            "Special Considerations": "Pregnancy category C. Caution in Child < 6 years old. Storage Store in a light resistant container. Stability: Lasts 6 months refrigerated; Lasts 4 weeks at room temperature: Discard if solution discolors (should be clear)"
        },

        {
            "Name": "THIAMINE (Vitamin B1)",
            "Class": "Vitamin (B1)",
            "Mechanism Of Action": "Combines with ATP to form thiamine pyrophosphate coenzyme, a necessary component for carbohydrate metabolism. The brain is extremely sensitive to thiamine deficiency.",
            "Indications": "Delirium tremens. Wernicke’s encephalopathy.",
            "Contraindications": "None",
            "Adverse Reactions": "Hypotension from too rapid injection or too high a dose. Anxiety, diaphoresis, nausea, vomiting.  Rare allergic reaction.",
            "Drug Interactions": "",
            "Adult Dosage": "100 mg slow IV or IM.",
            "Pediatric Dosage": "10-25 mg slow IV or IM.",  
            "Duration Of Action": "Onset: Rapid. Peak effects: variable. Duration: Dependent upon degree of deficiency.",
            "Special Considerations": "Pregnancy safety: Category A. Large IV doses may cause respiratory difficulties. Anaphylaxis reactions reported."
        },

        {
            "Name": "TRANEXAMIC ACID (TXA, Cyklokapron)",
            "Class": "Hemostatic agent, antifibrinolytic, plasminogen inactivator",
            "Mechanism Of Action": "Reduces plasminogen activation, mitigating conversion to plasmin.",
            "Indications": "Blunt or penetrating trauma less than 3 hours from MOI, with hemodynamic compromise, bleeding.",
            "Contraindications": "Hypersensitivity; subarachnoid hemorrhage; history of PE, DVT, or other thromboembolic event; mechanism of injury greater than 3 hours.",
            "Adverse Reactions": "Fatigue, headache, abdominal pain, anemia, DVT, PE, other thromboembolic disorder. Rapid infusion may cause hypotension.",
            "Drug Interactions": "Hormonal contraceptives",
            "Adult Dosage": "1000 mg in 100mL of NS infused over 10 minutes",
            "Pediatric Dosage": "Not recommended.",  
            "Duration Of Action": "Onset: Unknown Peak Effect: Unknown Duration: 7-8 hours",
            "Special Considerations": "Pregnancy Safety: Category C. Use in pregnant and breastfeeding women should be clearly indicated. Must be mixed into an infusion bag, typically 100 mL of NS."
        },

        {
            "Name": "VASOPRESSIN (Pitressin) ",
            "Class": " Naturally occurring antidiuretic hormone",
            "Mechanism Of Action": "Vasopressin acts by direct stimulation of smooth muscle receptors. When given in extremely high doses, it acts as a noradrenergic peripheral vasoconstrictor.",
            "Indications": "As an alternative pressor to epinephrine in adult cardiac arrest. Vasodilatory shock",
            "Contraindications": "Responsive patients with coronary artery disease",
            "Adverse Reactions": "Ischemic chest pain, Abdominal distress, Sweating, Nausea and vomiting, Tremors Bronchial constriction, Uterine contraction",
            "Drug Interactions": "No significant drug reactions have been reported.",
            "Adult Dosage": "Ventricular fibrillation/cardiac arrest: 40 units IV/IO push; may replace either first or second dose of epinephrine. Vasodilatory shock: Continuous infusion of 0.02-0.04 unit/min",
            "Pediatric Dosage": "Cardiac arrest: 0.4-1 unit/kg IV/IO bolus (max 40 units). Hypotension (continuous infusion): 0.0002-0.002 unit/ kg/min (0.2-2 milliunits/kg/min)",  
            "Duration Of Action": "Onset: Immediate. Duration: Variable",
            "Special Considerations": "Pregnancy safety: Category C. Vasopressin may increase peripheral vascular resistance and provoke cardiac ischemia and angina. Not recommended for responsive patients with coronary. artery disease."
        },

        {
            "Name": "VECURONIUM (Norcuron)",
            "Class": "Nondepolarizing neuromuscular blocker",
            "Mechanism Of Action": "Vecuronium is an intermediate-acting, non-depolarizing, neuromuscular blocking agent. Non-depolarizing agents produce skeletal muscle paralysis by blockade at the myoneural junction. Unlike depolarizing agents, vecuronium has little agonist activity, with no depolarizing effect at the motor endplate.",
            "Indications": "To facilitate intubation Muscle relaxation",
            "Contraindications": "Bromide hypersensitivity. Inability to control airway and/or support ventilations with oxygen and positive pressure. Bradycardias, dysrhythmias, hypotension, respiratory depression, muscular disease, malignant hyperthermia.",
            "Adverse Reactions": "Rare hypersensitivity reactions (e.g., bronchospasm, flushing, erythema, urticaria, hypotension, sinus tachycardia), excessive doses of vecuronium can cause prolonged apnea, dyspnea, respiratory depression, and/or profound muscular weakness (muscle paralysis).",
            "Drug Interactions": "Can interact with opiate agonists by increasing the incidence and severity of bradycardia and hypotension. Administration of IV phenytoin to patients currently receiving vecuronium has been noted to augment the neuromuscular activity of vecuronium.",
            "Adult Dosage": "Neuromuscular Blockade: 80-100 mcg/kg IV; reconstitute by adding 10 or 20 mL of bacteriostatic water for injection to 10 or 20 mg, respectively, to give a parenteral solution containing 1 mg/ml. Rapid Sequence Intubation Adults - 0.1-02 mg/kg IV/IO",
            "Pediatric Dosage": "Neuromuscular Blockade: Adolescents, and children >10 years: 80-100 mcg/kg IV; reconstitute by adding 10 or 20 mL of bacteriostatic water for injection to 10 or 20 mg, respectively, to give a parenteral solution containing 1 mg/ml. Rapid Sequence Intubation Adults - 0.1-02 mg/kg IV/IORapid Sequence Intubation; Children 0.1-0.3 mg/kg IV/IO",  
            "Duration Of Action": "Onset: Within 1 min. Duration: 25-40 min (dose related)",
            "Special Considerations": "Pregnancy safety: Category C. Reconstituted vecuronium, do not mix with alkaline solutions (e.g., barbiturate solutions such as thiopental) in the same syringe or administer simultaneously during intravenous infusion through the same needle or through the same intra- venous line."
        },

        {
            "Name": "VERAPAMIL (Isoptin)",
            "Class": "Calcium channel blocker (Class IV antidysrhythmic)",
            "Mechanism Of Action": "Verapamil inhibits the movement of calcium ions across cell membranes. The slow calcium ion current blocked by verapamil is more important for the activity of the sinoatrial node and atrioventricular node than for many other tissues in the heart. Verapamil decreases atrial automaticity, reduces atrioventricular conduction velocity, and prolongs the atrioventricular nodal refractory period. In addition, verapamil depresses myocardial contractility, reduces vascular smooth muscle tone, and dilates coronary arteries and arterioles in normal and ischemic tissues.",
            "Indications": "Give only to narrow-complex reentry supraventricular tachycardias or known supraventricular dysrhythmias. Atrial flutter with a rapid ventricular response, atrial fibrillation with a rapid ventricular response, Multifocal atrial tachycardia, Vasospastic and unstable angina",
            "Contraindications": "Hypersensitivity, Sick sinus syndrome (unless the patient has a functioning pacemaker), Second- or third-degree heart block. Sinus bradycardia, Hypotension, Cardiogenic shock, Severe congestive heart failure, Wolff-Parkinson-White syndrome with atrial fibrillation or flutter. Patients receiving IV beta blockers. Give with extreme caution to patients receiving oral beta blockers. Wide-complex tachycardias of uncertain origin (ventricular tachycardia can deteriorate into ventricular fibrillation when calcium channel blockers are given.)",
            "Adverse Reactions": "Dizziness, Headache, Nausea and vomiting, Hypotension, Bradycardia, Complete atrioventricular block, Peripheral edema",
            "Drug Interactions": "Verapamil increases serum concentration of digoxin. Beta-adrenergic blockers may have additive negative inotropic and chronotropic effects. Antihypertensives may potentiate hypotensive effects.",
            "Adult Dosage": "Initial dose: 2.5-5 mg slow IV bolus over 2 min (over 3 min in older patients). Repeat dose: 5-10mg bolus in 15-30 min after initial dose if needed; or 5 mg bolus every 15 min until a desired response is achieved (max dose 30 mg)",
            "Pediatric Dosage": "Not recommended in the prehospital setting",  
            "Duration Of Action": "Onset: 1-5 min. Duration: 30-60 min (may persist longer)",
            "Special Considerations": "Pregnancy safety: Category C, closely monitor patient’s vital signs. Be prepared to resuscitate. Atrioventricular block or asystole may occur because of slowed atrioventricular conduction."
        }
    ]
}


