{
    "drugs":[

        {
            "Name": "ACETAMINOPHEN (Tylenol, Ofrimev)",
            "Class": "An analgesic and anti-pyretic",
            "Mechanism Of Action": "Acetaminophen is an analgesics and antipyretics. The exact mechanism of action of acetaminophen is not known. It may reduce the production of prostaglandins in the brain. Prostaglandins are chemicals that cause inflammation and swelling. Acetaminophen relieves pain by elevating the pain threshold, that is, by requiring a greater amount of pain to develop before a person feels it. It reduces fever through its action on the heat-regulating center of the brain. Specifically, it tells the center to lower the body's temperature when the temperature is elevated.",
            "Indications": "An effective analgesic and anti-pyretic for the treatment of fever and pain.",
            "Contraindications": "Allergy to medication. Severe liver disease.",
            "Adverse Reactions": "",
            "Drug Interactions": "",
            "Adult Dosage": "650 - 1000 mg, PO q 4 hrs to a daily maximum of 3000 mg",
            "Pediatric Dosage": "15 mg/kg PO or PR q 4 hrs",  
            "Duration Of Action": "Onset: 30 - 45 minutes. Peak Effect: 30-60 minutes. Duration: 4-6 hrs",
            "Special Considerations": "Avoid in patients with severe liver disease"
        },

        {
            "Name": "ACTIVATED CHARCOAL",
            "Class": "Adsorbent",
            "Mechanism Of Action": "Adsorbs toxic substances from the GI Tract; Onset of action is immediate.",
            "Indications": "Most oral poisonings and medication overdoses; can be used after evacuation of poisons.",
            "Contraindications": "Oral administration to comatose patient; after ingestion of corrosives, caustics or petroleum distillates (ineffective and may induce vomiting); simultaneous administration with other oral drugs.",
            "Adverse Reactions": "May induce nausea and vomiting; may cause constipation; may cause black stools.",
            "Drug Interactions": "Bonds with and generally inactivates whatever it is mixed with, e.g., syrup of ipecac.",
            "Adult Dosage": "1-2 gm/kg PO or via NGT",
            "Pediatric Dosage": "1-2 gm/kg PO or via NGT",  
            "Duration Of Action": "Depends upon GI function; will act until excreted.",
            "Special Considerations": "Often used in conjunction with magnesium citrate, Must be stored in a closed container, Does not adsorb cyanide, lithium, iron, lead and arsenic."
        },

        {
            "Name": "ADENOSINE (Adenocard)",
            "Class": "Endogenous Nucleotide",
            "Mechanism Of Action": "Slows conduction time through the AV Node; can interrupt re-entrant pathways; slows heart rate; acts directly on sinus pacemaker cells. Is drug of choice for PSVT.",
            "Indications": "Conversion of PSVT to sinus rhythm. May convert PSVT due to Wolff-Parkinson- White syndrome. Not effective converting atrial fibrillation / flutter.",
            "Contraindications": "Second or third-degree block or Sick Sinus Syndrome Atrial flutter / atrial fibrillation, Ventricular Tachycardia, Hypersensitivity to adenosine",
            "Adverse Reactions": "Facial flushing, shortness of breath, chest pain, headache, paresthesia, diaphoresis, palpitations, hypotension, nausea, metallic taste.",
            "Drug Interactions": "Methylxanthines (theophylline-like drugs) antagonize the effects of adenosine. Dipyridamole (Persantine) potentiates the effects of adenosine, Carbamazepine (Tegretol) may potentate the AV Node blocking effects of adenosine.",
            "Adult Dosage": " 6 mg over 1-3 seconds; If no response after 1-2 minutes, administer 12 mg over 1-3 seconds, Maximum total dose = 18 mgs.",
            "Pediatric Dosage": "0.1 mg/kg rapid IV; If no response after 1-2 minutes, administer 0.2mg/kg over 1-3 seconds, Maximum total dose = 18 mgs. Maximum single dose = 12 mgs.",  
            "Duration Of Action": "Onset and peak effects in seconds; duration 12 seconds.",
            "Special Considerations": "Short half-life limits side effects in most patients. Pregnancy safety: Category C."
        },

        {
            "Name": "ALBUTEROL (Proventil, Ventolin)",
            "Class": "Sympathomimetic, bronchodilator.",
            "Mechanism Of Action": "Selective b-2 agonist which stimulates adrenergic receptors of the sympathomimetic nervous system resulting in smooth muscle relaxation in the bronchial tree and peripheral vasculature.",
            "Indications": "Treatment of bronchospasm in patients with reversible obstructive airway disease (COPD/asthma).",
            "Contraindications": "Known prior hypersensitivity reactions to Albuterol. Tachycardia, dysrhythmias, especially those caused by digitalis. Synergistic with other sympathomimetics",
            "Adverse Reactions": "Often dose-related and include restlessness, tremors, dizziness, palpitations, tachycardia, nervousness, peripheral vasodilatation, nausea, vomiting, hyperglycemia, increased blood pressure and paradoxical bronchospasm",
            "Drug Interactions": "Tricyclic antidepressants may potentate vasculature effects. Beta-blockers are antagonistic. May potentate hypokalemia caused by diuretics.",
            "Adult Dosage": ": Administer 2.5 mg. Dilute 0.5 ml of 0.5% solution for inhalation with 2.5 ml normal saline in nebulizer and administer over 10-15 minutes.",
            "Pediatric Dosage": "2.5mg in 6mL NS",  
            "Duration Of Action": "5-15 minutes with peak effect in 30-minutes - two hours and duration of 3-4 hours.",
            "Special Considerations": "Pregnancy Safety: Category C. Antagonized by beta-blockers (e.g., Inderal, Metoprolol). May precipitate angina pectoris and dysrhythmias. Should only be administered by inhalation methodology in pre-hospital management."
        },

        {
            "Name": "AMIODARONE (Cordarone)",
            "Class": "Antidysrhythmic.",
            "Mechanism Of Action": "Prolongation of Action Potential; non-competitive alpha and beta sympathetic blocking effects; Calcium channel blocking effects.",
            "Indications": "Suppression of Ventricular Fibrillation/ Pulseless Ventricular Tachycardia refractory to defibrillation, Suppression of Ventricular Tachycardia with a pulse",
            "Contraindications": "Allergy to Iodine, Medication-induced Ventricular dysrhythmias, Torsades de Pointes.",
            "Adverse Reactions": "Hypotension, Bradycardia, Pulseless Electrical Activity, Congestive Heart Failure. Nausea, fever",
            "Drug Interactions": "Will precipitate with Sodium Bicarbonate: incompatible.",
            "Adult Dosage": "VF/ Pulseless VT: 300 mg IV Push in 14 ml Normal Saline, Repeat Dose: 150mg in 7ml Normal saline, V TAC with a Pulse: 150mg in 100mL NS infused over 10 minutes",
            "Pediatric Dosage": " 5mg/kg slow IV Push over 1-2 minutes in 10 ml Normal Saline,",  
            "Duration Of Action": "Onset: Within 5-15 minutes. Peak Effect: Variable. Duration: Variable",
            "Special Considerations": "Pregnancy safety: Category C, Administer cautiously in patients with Heart Failure or poor systolic function."
        }
    ]
}


